{
  "products": [
    {
      "id": 0,
      "name": "Velvet Sofa",
      "description": "Risus feugiat in ante metus. Venenatis cras sed felis eget velit aliquet sagittis id. Ullamcorper malesuada proin libero nunc. Nulla aliquet porttitor lacus luctus accumsan. Lectus nulla at volutpat diam ut venenatis. Sit amet luctus venenatis lectus magna fringilla urna porttitor rhoncus. Scelerisque mauris pellentesque pulvinar pellentesque habitant morbi. Diam ut venenatis tellus in metus vulputate eu scelerisque. Enim nunc faucibus a pellentesque. Vitae nunc sed velit dignissim sodales ut. Purus in massa tempor nec feugiat nisl pretium. Accumsan in nisl nisi scelerisque. Pretium lectus quam id leo in vitae. Arcu non odio euismod lacinia at quis risus sed. Luctus venenatis lectus magna fringilla urna porttitor rhoncus. Ut tellus elementum sagittis vitae et leo duis ut diam. Sit amet massa vitae tortor condimentum lacinia quis vel eros. Nunc scelerisque viverra mauris in aliquam sem fringilla. Sollicitudin nibh sit amet commodo nulla facilisi nullam vehicula ipsum."
    },
    {
      "id": 1,
      "name": "Fancy Armchair",
      "description": "Tristique et egestas quis ipsum suspendisse. Vestibulum rhoncus est pellentesque elit ullamcorper. Ultrices in iaculis nunc sed augue lacus viverra. Curabitur vitae nunc sed velit dignissim sodales ut eu sem. Duis tristique sollicitudin nibh sit amet commodo nulla facilisi. Venenatis tellus in metus vulputate eu scelerisque felis. Eget egestas purus viverra accumsan. Nibh ipsum consequat nisl vel pretium lectus quam. Aliquet sagittis id consectetur purus ut faucibus pulvinar. Sollicitudin aliquam ultrices sagittis orci a scelerisque. Aliquam vestibulum morbi blandit cursus risus at ultrices. Tortor at risus viverra adipiscing at."
    },
    {
      "id": 2,
      "name": "Plain Bed",
      "description": "Praesent semper feugiat nibh sed pulvinar proin gravida. Commodo sed egestas egestas fringilla phasellus faucibus. Duis tristique sollicitudin nibh sit amet commodo nulla facilisi nullam. Fringilla urna porttitor rhoncus dolor purus non enim praesent elementum. Turpis cursus in hac habitasse platea. Magna etiam tempor orci eu lobortis elementum nibh tellus. Nisl pretium fusce id velit ut tortor pretium. Non sodales neque sodales ut etiam sit amet nisl purus. Dui vivamus arcu felis bibendum ut tristique et egestas. Aliquam etiam erat velit scelerisque. Quis ipsum suspendisse ultrices gravida dictum fusce ut placerat orci. Amet purus gravida quis blandit."
    },
    {
      "id": 3,
      "name": "Huge Rug",
      "description": "Tortor condimentum lacinia quis vel eros donec. Vel elit scelerisque mauris pellentesque pulvinar pellentesque habitant. Eu mi bibendum neque egestas. Sapien pellentesque habitant morbi tristique. Tincidunt lobortis feugiat vivamus at augue eget. Tellus in metus vulputate eu. Sed enim ut sem viverra aliquet eget sit amet tellus. Egestas dui id ornare arcu odio ut sem nulla. Nulla malesuada pellentesque elit eget gravida cum sociis natoque. Augue neque gravida in fermentum et sollicitudin ac orci. Tincidunt augue interdum velit euismod in. Lectus mauris ultrices eros in. Sem viverra aliquet eget sit amet tellus cras adipiscing enim. Nec nam aliquam sem et tortor consequat id. Quis commodo odio aenean sed. Odio euismod lacinia at quis risus sed vulputate. Eget dolor morbi non arcu risus quis varius quam. Quis hendrerit dolor magna eget. Fames ac turpis egestas sed tempus urna."
    }
  ],
  "reviews": [
    {
      "id": 1,
      "author": "Oliver",
      "star_rating": 5,
      "headline": "I love this product!",
      "body": "This sofa has completely changed my life. The delivery process couldn't have been easier. I want to sing about Oliver Space from the rooftops!",
      "productId": "0"
    },
    {
      "author": "new",
      "star_rating": 5,
      "headline": "Love it",
      "body": "Would rent this dining room table one hundred times over.",
      "productId": "0",
      "id": 2
    }
  ]
}